home/controllers/BaseController.php

    public function beforeAction($action)
    {
        parent::beforeAction($action);


        //如果为开放权限不用调用用户菜单转layout
        $this->allowUrl = array_merge(Yii::$app->params['allowUrl'], $this->allowUrl);


        if (!Yii::$app->user->isGuest) {
            $this->user = Yii::$app->user;
            $this->modelUser = (new \common\models\User)::findOne($this->user->id);
            $this->modelUserInfo = $this->modelUser->hasOne((new \common\models\UserInfo)::className(), ['uid' => 'id'])->one();
            $this->modelSchoolInfo = $this->modelUser->hasOne((new \common\models\SchoolInfo)::className(), ['id' => 'school_id'])->one();
---
SELECT * FROM `edu_user_info` WHERE `uid`=1
SELECT * FROM `edu_school_info` WHERE `id`=0